app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["created_at", Wed, 19 Mar 2014 17:11:32 UTC +00:00], ["post_id", 4], ["updated_at", Wed, 19 Mar 2014 17:11:32 UTC +00:00]]
---
        def create
                @post = Post.find(params[:post_id])
                @comment = @post.comments.create!(comment_params)