app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a test post bitches."], ["created_at", Wed, 19 Mar 2014 15:42:39 UTC +00:00], ["title", "Test Post"], ["updated_at", Wed, 19 Mar 2014 15:42:39 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save